## plan
```diff
+ Green
- Red
! Orange
@@ Pink @@
#Gray
module.complete.data.archive_file.lambda_zip: Reading...
module.complete.data.archive_file.lambda_zip: Read complete after 0s [id=7517866eb05f876f45c1f92f4725f6c55a51fdd7]
module.key-pair.tls_private_key.this[0]: Refreshing state... [id=9b798b0ada01ea1e1e5861df12a034f38aa754ec]
random_id.this: Refreshing state... [id=6A]
data.http.my_public_ip: Reading...
module.complete.random_id.this: Refreshing state... [id=2g]
module.complete.data.http.my_public_ip: Reading...
data.http.my_public_ip: Read complete after 1s [id=https://ifconfig.co/json]
module.complete.data.http.my_public_ip: Read complete after 1s [id=https://ifconfig.co/json]
module.complete.data.aws_ami_ids.sfos: Reading...
module.key-pair.aws_key_pair.this[0]: Refreshing state... [id=sophos-example-completee8]
module.complete.data.aws_availability_zones.available: Reading...
module.complete.aws_secretsmanager_secret.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-da-M1m7dl]
module.complete.data.aws_iam_policy_document.trust_relationship: Reading...
module.complete.data.aws_iam_policy_document.lambda_execution_trust_policy: Reading...
data.aws_availability_zones.available: Reading...
module.complete.data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
module.complete.aws_secretsmanager_secret.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-da-OMJi1f]
module.complete.data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_iam_policy_document.lambda_execution_trust_policy: Read complete after 0s [id=3693445097]
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-da-OMJi1f]
module.complete.data.aws_region.current: Reading...
module.complete.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
module.complete.data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
module.complete.aws_vpc.this[0]: Refreshing state... [id=vpc-0fbf98e2292eee5c6]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zone.available["us-west-1b"]: Reading...
data.aws_availability_zone.available["us-west-1c"]: Reading...
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Reading...
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-da-OMJi1f|ED2381EE-3FD3-4F9D-B1EA-CA34EF59E1DE]
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Read complete after 0s [id=1862222295]
module.complete.aws_secretsmanager_secret_version.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-da-M1m7dl|8D39DB1A-A1CD-4A1C-9D7C-6535BD556666]
module.complete.data.template_file.user_data: Reading...
module.complete.data.template_file.user_data: Read complete after 0s [id=f908a50202718beb192427899bbddf0729f0d75dc526e77f91aa86739d3914fd]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Reading...
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Read complete after 0s [id=4236802839]
module.complete.aws_secretsmanager_secret_version.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-da-OMJi1f|3CD7B4CE-8D3B-4B28-8658-0DF09311BF36]
data.aws_availability_zone.available["us-west-1c"]: Read complete after 0s [id=us-west-1c]
module.complete.aws_iam_role.this: Refreshing state... [id=ec2-iam-role-SOPHOS_CNF-da-447552758530]
data.aws_availability_zone.available["us-west-1b"]: Read complete after 0s [id=us-west-1b]
module.complete.data.aws_ami_ids.sfos: Read complete after 1s [id=1726762986]
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Read complete after 0s [id=ami-0b68236d144f48351]
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Read complete after 0s [id=ami-0434af33056d1e189]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Read complete after 0s [id=ami-0028214389e81fc39]
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Read complete after 0s [id=ami-065fabeba927f04d3]
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Read complete after 0s [id=ami-053dbe57dfe422765]
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Read complete after 0s [id=ami-07186848dc5aa7580]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Read complete after 0s [id=ami-026c32ba32c93b8c4]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Read complete after 0s [id=ami-03cbb6f8e3173ca7a]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Read complete after 0s [id=ami-030bf19f87a227c8a]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Read complete after 0s [id=ami-059bf44c0f5e904d9]
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Read complete after 0s [id=ami-0f37b9b5182756d01]
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Read complete after 0s [id=ami-091558582143f9648]
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Read complete after 0s [id=ami-04b0be28f678af9ee]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Read complete after 0s [id=ami-0442ca42ae7162b75]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Read complete after 0s [id=ami-0eafce265f8e28d06]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Read complete after 0s [id=ami-0fb2a8cf2684fdb0c]
module.complete.aws_security_group.trusted[0]: Refreshing state... [id=sg-0a8c96f8271927387]
module.complete.aws_internet_gateway.this[0]: Refreshing state... [id=igw-067f93f851b1a6006]
module.complete.aws_subnet.private[0]: Refreshing state... [id=subnet-0987d49c80ddee3bb]
module.complete.aws_security_group.lan[0]: Refreshing state... [id=sg-00061adae937156fd]
module.complete.aws_subnet.public[0]: Refreshing state... [id=subnet-0e44560ceef6b4622]
module.complete.aws_route_table.public[0]: Refreshing state... [id=rtb-028b335a7d63fa993]
module.complete.aws_route_table.private[0]: Refreshing state... [id=rtb-077e5d8d215947551]
module.complete.aws_security_group.public[0]: Refreshing state... [id=sg-0a79b3c06a4743791]
module.complete.aws_iam_instance_profile.this: Refreshing state... [id=ec2-instance-profile-SOPHOS_CNF-da]
module.complete.aws_route.public: Refreshing state... [id=r-rtb-028b335a7d63fa9931080289494]
module.complete.aws_network_interface.private: Refreshing state... [id=eni-0f1d46884f92085b4]
module.complete.aws_network_interface.public: Refreshing state... [id=eni-05d4f539027f147b0]
module.complete.aws_route_table_association.public: Refreshing state... [id=rtbassoc-0cdb7068582c24899]
module.complete.aws_route_table_association.private: Refreshing state... [id=rtbassoc-03bdc2967fce3948e]
module.complete.aws_route.private: Refreshing state... [id=r-rtb-077e5d8d2159475511080289494]
module.complete.aws_iam_role.lambda_execution_role: Refreshing state... [id=LambdaExecutionRole-SOPHOS_CNF-da]
module.complete.aws_eip.this[0]: Refreshing state... [id=eipalloc-0535a7ff48d693db4]
module.complete.aws_launch_template.this: Refreshing state... [id=lt-06d4992d966f3bdfd]
module.complete.aws_instance.this: Refreshing state... [id=i-0818e84cc63e2a48a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.complete.data.aws_iam_policy_document.lambda_execution_inline_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_execution_inline_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "ec2:AttachNetworkInterface",
+               "ec2:CreateNetworkInterface",
+               "ec2:DeleteNetworkInterface",
+               "ec2:DescribeInstances",
+               "ec2:DescribeNetworkInterfaces",
            ]
+           resources = [
+               "arn:aws:ec2:us-west-1:447552758530:network-interface/eni-0f1d46884f92085b4",
            ]
        }
    }

  # module.complete.aws_eip.this[0] will be updated in-place
  ~ resource "aws_eip" "this" {
        id                        = "eipalloc-0535a7ff48d693db4"
      ~ tags                      = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.complete.aws_iam_instance_profile.this will be updated in-place
  ~ resource "aws_iam_instance_profile" "this" {
        id          = "ec2-instance-profile-SOPHOS_CNF-da"
        name        = "ec2-instance-profile-SOPHOS_CNF-da"
      ~ tags        = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all    = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_iam_role.lambda_execution_role will be updated in-place
  ~ resource "aws_iam_role" "lambda_execution_role" {
        id                    = "LambdaExecutionRole-SOPHOS_CNF-da"
        name                  = "LambdaExecutionRole-SOPHOS_CNF-da"
      ~ tags                  = {} -> (known after apply)
        # (9 unchanged attributes hidden)

+       inline_policy {
+           name   = "lambda-config-policy-SOPHOS_CNF-da"
+           policy = (known after apply)
        }
    }

  # module.complete.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "ec2-iam-role-SOPHOS_CNF-da-447552758530"
        name                  = "ec2-iam-role-SOPHOS_CNF-da-447552758530"
      ~ tags                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all              = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.complete.aws_instance.this will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-0818e84cc63e2a48a"
      ~ source_dest_check                    = false -> true
      ~ tags                                 = {
-           "Name"          = "sophos-xg-terraform"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                             = {
-           "Name"          = "sophos-xg-terraform"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ user_data                            = "22e36724f41542bb486517b9c9ca0b2356b438d6" -> "3bd356c49c0f306404bb4f0e14a9fc2251e4319d"
        # (28 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # module.complete.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-067f93f851b1a6006"
      ~ tags     = {
-           "Name"          = "igw-SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all = {
-           "Name"          = "igw-SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.complete.aws_lambda_function.this will be created
+   resource "aws_lambda_function" "this" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       filename                       = "../../initial_config.zip"
+       function_name                  = "XG-Initial-Config-SOPHOS_CNF-da"
+       handler                        = "config.main"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = false
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = "arn:aws:iam::447552758530:role/LambdaExecutionRole-SOPHOS_CNF-da"
+       runtime                        = "python3.7"
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags_all                       = (known after apply)
+       timeout                        = 3
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "CONSOLE_SECRET_NAME" = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-da-OMJi1f"
+               "IP"                  = "10.0.1.136"
+               "PASSWORD"            = "admin"
+               "REGION_NAME"         = "us-west-1"
+               "USERNAME"            = "admin"
            }
        }

+       ephemeral_storage {
+           size = (known after apply)
        }

+       tracing_config {
+           mode = (known after apply)
        }

+       vpc_config {
+           security_group_ids = [
+               "sg-00061adae937156fd",
            ]
+           subnet_ids         = [
+               "subnet-0987d49c80ddee3bb",
            ]
+           vpc_id             = (known after apply)
        }
    }

  # module.complete.aws_launch_template.this will be updated in-place
  ~ resource "aws_launch_template" "this" {
        id                      = "lt-06d4992d966f3bdfd"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "launch-template-SOPHOS_CNF-da-447552758530"
      ~ tags                    = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.complete.aws_network_interface.private will be updated in-place
  ~ resource "aws_network_interface" "private" {
        id                        = "eni-0f1d46884f92085b4"
      ~ tags                      = {
-           "Name"          = "private-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "Name"          = "private-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.complete.aws_network_interface.public will be updated in-place
  ~ resource "aws_network_interface" "public" {
        id                        = "eni-05d4f539027f147b0"
      ~ tags                      = {
-           "Name"          = "public-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "Name"          = "public-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.complete.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-077e5d8d215947551"
      ~ tags             = {
-           "Name"          = "priv-rtb-SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
-           "Name"          = "priv-rtb-SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-028b335a7d63fa993"
      ~ tags             = {
-           "Name"          = "pub-rtb-SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
-           "Name"          = "pub-rtb-SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.lan[0] will be updated in-place
  ~ resource "aws_security_group" "lan" {
        id                     = "sg-00061adae937156fd"
        name                   = "Private Subnet"
      ~ tags                   = {
-           "Name"          = "LAN"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "LAN"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.public[0] will be updated in-place
  ~ resource "aws_security_group" "public" {
        id                     = "sg-0a79b3c06a4743791"
        name                   = "Public"
      ~ tags                   = {
-           "Name"          = "Public"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "Public"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.trusted[0] will be updated in-place
  ~ resource "aws_security_group" "trusted" {
        id                     = "sg-0a8c96f8271927387"
      ~ ingress                = [
-           {
-               cidr_blocks      = [
-                   "47.184.79.94/32",
-                   "20.253.169.129/32",
                ]
-               description      = "Allow all from trusted IP"
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 65535
            },
+           {
+               cidr_blocks      = [
+                   "47.184.79.94/32",
+                   "52.165.37.202/32",
                ]
+               description      = "Allow all from trusted IP"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
        ]
        name                   = "Trusted Network"
      ~ tags                   = {
-           "Name"          = "Trusted Network"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "Trusted Network"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.complete.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0e44560ceef6b4622"
      ~ tags                                           = {
-           "Name"          = "public-SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                                       = {
-           "Name"          = "public-SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.complete.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-0fbf98e2292eee5c6"
      ~ tags                             = {
-           "Name"          = "SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                         = {
-           "Name"          = "SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (15 unchanged attributes hidden)
    }

Plan: 1 to add, 16 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```